{
  "_name_or_path": "unsloth/qwen2.5-3b-instruct-unsloth-bnb-4bit",
  "architectures": ["Qwen2ForCausalLM"],
  "attention_dropout": 0.0,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 32768,
  "model_type": "qwen2",
  "num_attention_heads": 16,
  "num_hidden_layers": 36,
  "num_key_value_heads": 2,
  "pad_token_id": 151654,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "torch_dtype": "float16",
  "transformers_version": "4.49.0",
  "unsloth_fixed": true,
  "unsloth_version": "2025.3.14",
  "use_cache": true,
  "vocab_size": 151936,

  "quantization": {
    "load_in_4bit": true
  },

  "lora": {
    "init_lora_weights": true,
    "lora_alpha": 64,
    "lora_bias": false,
    "lora_dropout": 0,
    "target_modules": [
      "up_proj",
      "o_proj",
      "q_proj",
      "gate_proj",
      "v_proj",
      "k_proj",
      "down_proj"
    ]
  }
}
